Core/src/Documents/AzRyДоговор/AzRyДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyДоговор</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.AzRyВидыОперацийКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поступлено</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юрист</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудит</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектыВерсия</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСуммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куриер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловияДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныеУсловияТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержкеДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходКПоддержкеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслугиДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходВУслугиТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпанииНаимОрг</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеИзСвоейКомпанииДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДоговорТипПродажи</name>
    <type>
      <types>EnumRef.AzRyДоговорТипПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительНаправления</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоВладелец</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонМобильный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Деиствие</name>
      <type>
        <types>CatalogRef.AzRyДеиствие</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипПродажи</name>
    <attributes>
      <name>И</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСоглашения</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродажи</name>
      <type>
        <types>EnumRef.AzRyДоговорТипПродажи</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйЗаПроизводство</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйЗаСписаниеЗапасов</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьСписаниеЗапасов</name>
      <type>
        <types>EnumRef.AzRyДоговорПериодичностьСписаниеЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Экаунт</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проект1</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукт</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Экаунт</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/AzRyДоговор/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ЭлементУО;

//////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


&НаСервере
Функция ПолучитьКурсВалюты(Дата, ВалютаДокумента)

	СтрПарам = Новый Структура;
	
	ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаДокумента));
	
	СтрПарам.Вставить("Курс", ?(ВалютаРасчетовКурсКратность.Курс = 0, 0, ВалютаРасчетовКурсКратность.Курс));
	СтрПарам.Вставить("Кратность", ?(ВалютаРасчетовКурсКратность.Кратность = 0, 0, ВалютаРасчетовКурсКратность.Кратность));
	
	Возврат СтрПарам;
	
КонецФункции
 
&НаКлиенте
Процедура ПриИзмененийВалютыТаблицы()

	СтрокаТабличнойЧасти = Элементы.СуммыДокументаВРазнихВалютах.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Курс) Тогда 		
		КурсКратность = ПолучитьКурсВалюты(Объект.Дата, СтрокаТабличнойЧасти.Валюта);
		СтрокаТабличнойЧасти.Курс      = КурсКратность.Курс;
		СтрокаТабличнойЧасти.Кратность = КурсКратность.Кратность;
	КонецЕсли;	
	
	СтрокаТабличнойЧасти.Сумма = Объект.Сумма * (СтрокаТабличнойЧасти.Курс / СтрокаТабличнойЧасти.Кратность);
		
КонецПроцедуры 

Функция ТипПродажиГотоваяПродукция(ТипПродажи)

	Возврат ТипПродажи = Перечисления.AzRyДоговорТипПродажи.ГотоваяПродукция;	

КонецФункции
 

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	//УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
	//Объект,
	//,
	//Параметры.ЗначениеКопирования,
	//Параметры.Основание,
	//СостояниеДокумента,
	//КартинкаСостоянияДокумента,
	//РазрешеноПроведение,
	//Параметры.ЗначенияЗаполнения
	//);
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда 
		Объект.ВалютаДокумента = Справочники.Валюты.ПустаяСсылка();	
		СтрПарам = ПолучитьКурсВалюты(Объект.Дата, Объект.ВалютаДокумента);
		Объект.Курс = СтрПарам.Курс;
		Объект.Кратность = СтрПарам.Кратность;
	КонецЕсли;
	
	УО = ЭтаФорма.УсловноеОформление; 
	УО.Элементы.Очистить(); 
	ЭлементУО = УО.Элементы.Добавить();
	
	ОбновитьОформлениеТЗ();
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновытьОформлениеСтраницыТипПродажы();
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		ЭтаФорма.Элементы.Проекты.Доступность = Ложь;		
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ПроектыВерсия) Тогда
		ЭтаФорма.Элементы.ПроектыВерсия.Доступность = Ложь;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеНебольшойФирмойКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Курс) Тогда 
		СтрПарам = ПолучитьКурсВалюты(Объект.Дата, Объект.ВалютаДокумента);
		Объект.Курс = СтрПарам.Курс;
		Объект.Кратность = СтрПарам.Кратность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = ПроверкаДанныхПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ГарантийныеУсловияПриИзменении(Элемент)
	ОбновытьОформлениеСтраницыТипПродажы();	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКПоддержкеПриИзменении(Элемент)
	ОбновытьОформлениеСтраницыТипПродажы();
КонецПроцедуры

&НаКлиенте
Процедура ПереходВУслугиПриИзменении(Элемент)
	ОбновытьОформлениеСтраницыТипПродажы();
КонецПроцедуры

&НаКлиенте
Процедура ПриобретениеИзСвоейКомпанииПриИзменении(Элемент)
	ОбновытьОформлениеСтраницыТипПродажы();
КонецПроцедуры

&НаКлиенте
Процедура ТипПродажиИПриИзменении(Элемент)
	ОбновитьОформлениеТЗ();
	Элементы.ТипПродажи.Обновить();
КонецПроцедуры 

&НаКлиенте
Процедура ТипПродажиПриАктивизацииЯчейки(Элемент)
	
	НовыйМассив = Новый Массив();			
	Если Элемент.ТекущиеДанные <> Неопределено И ТипПродажиГотоваяПродукция(Элемент.ТекущиеДанные.ТипПродажи) Тогда   
		Массив = Новый Массив();
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		НашеОписание = Новый ОписаниеТипов(Массив);
		Элемент.ТекущийЭлемент.ОграничениеТипа = НашеОписание;
	Иначе 			
		Массив = Новый Массив();
		Массив.Добавить(Тип("Строка"));
		НашеОписание = Новый ОписаниеТипов(Массив);
	    Элемент.ТекущийЭлемент.ОграничениеТипа = НашеОписание;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ОбновитьОформлениеТЗ()

	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	
	Для каждого ТС Из Объект.ТипПродажи Цикл
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Колонка");
		ТЗ.Колонки.Добавить("Значение");
		
		Если ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Услуга Тогда 
			// TODO ...
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Продукт Тогда
			// TODO ...
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.ГотоваяПродукция Тогда
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Колонка = "ТипПродажиОтветственныйЗаПроизводство";
			НоваяСтрока.Значение = Истина;
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Колонка = "ТипПродажиСпецификация";
			НоваяСтрока.Значение = Истина;
			
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Сервис Тогда
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Колонка = "ТипПродажиОтветственныйЗаПроизводство";
			НоваяСтрока.Значение = Истина;
			
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Колонка = "ТипПродажиПериодичностьСписаниеЗапасов";
			НоваяСтрока.Значение = Истина;	
			
		КонецЕсли;
		
		Если ТЗ.Количество() > 0 Тогда  			
			УсловноеОформлениеДобавитьУсловые(ТС.НомерСтроки, ТЗ, Ложь, Истина);
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновытьОформлениеСтраницыТипПродажы()
	
	Элементы.ГарантийныеУсловияДатаОкончания.АвтоОтметкаНезаполненного = Объект.ГарантийныеУсловия;
	Элементы.ГарантийныеУсловияДатаОкончания.ОтметкаНезаполненного     = Объект.ГарантийныеУсловия;
	Элементы.ГарантийныеУсловияТекст.Доступность                       = Объект.ГарантийныеУсловия;
	
	Элементы.ПереходКПоддержкеДатаОкончания.АвтоОтметкаНезаполненного  = Объект.ПереходКПоддержке;
	Элементы.ПереходКПоддержкеДатаОкончания.ОтметкаНезаполненного      = Объект.ПереходКПоддержке;
	Элементы.ПереходКПоддержкеТекст.Доступность                        = Объект.ПереходКПоддержке;
	
	Элементы.ПереходВУслугиДатаОкончания.АвтоОтметкаНезаполненного     = Объект.ПереходВУслуги;
	Элементы.ПереходВУслугиДатаОкончания.ОтметкаНезаполненного         = Объект.ПереходВУслуги;
	Элементы.ПереходВУслугиТекст.Доступность                           = Объект.ПереходВУслуги;
	
	Элементы.ПриобретениеИзСвоейКомпанииНаимОрг.АвтоОтметкаНезаполненного                   = Объект.ПриобретениеИзСвоейКомпании;
	Элементы.ПриобретениеИзСвоейКомпанииНаимОрг.ОтметкаНезаполненного                       = Объект.ПриобретениеИзСвоейКомпании;
	Элементы.ПриобретениеИзСвоейКомпанииДоговор.АвтоОтметкаНезаполненного = Объект.ПриобретениеИзСвоейКомпании;
	Элементы.ПриобретениеИзСвоейКомпанииДоговор.ОтметкаНезаполненного     = Объект.ПриобретениеИзСвоейКомпании;
	
КонецПроцедуры
  
&НаСервере
Процедура УсловноеОформлениеДобавитьУсловые(НомерСтроки, ТЗ, ТолькоПросмотр, ОтметкаНезаполненного) 
	
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	Для каждого ТекСтрока Из ТЗ Цикл
		Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); // Поля таблицы для которых будет действовать оформление 
		Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(ТекСтрока.Колонка); 
		Оформляемоеполе.Использование = ТекСтрока.Значение; 				
	КонецЦикла;
		
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); // отбор текущей строки таблицы 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТипПродажи.НомерСтроки"); 
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = НомерСтроки; 
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", ТолькоПросмотр);               // Установка оформления  
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", ОтметкаНезаполненного); // Установка оформления	
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДанныхПриЗаписи()

	Отказ = Ложь;
	
	// 1) Проверка таблицы "ТипПродажи"	
	Для каждого ТС Из Объект.ТипПродажи Цикл		
		Если ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Услуга Тогда 
			// TODO ...
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Продукт Тогда
			// TODO ...
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.ГотоваяПродукция Тогда	
			 
			Если Не ЗначениеЗаполнено(ТС.ОтветственныйЗаПроизводство) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поля таблицы документа [Тип продажи]["+ТС.НомерСтроки+"][Ответственный за производство] не заполнены.';ka='[გაყიდვის ტიპის]["+ТС.НомерСтроки+"][წარმოებაზე პას. პირი] დოკუმენტის ცხრილის ველები შეუვსებელია, გთხოვთ გადაამოწმეთ.'"), , ); Отказ = Истина;
			ИначеЕсли Не ЗначениеЗаполнено(ТС.Спецификация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поля таблицы документа [Тип продажи]["+ТС.НомерСтроки+"][Спецификация] не заполнены.';ka='[გაყიდვის ტიპის]["+ТС.НомерСтроки+"][სპეციფიკაცია] დოკუმენტის ცხრილის ველები შეუვსებელია, გთხოვთ გადაამოწმეთ.'"), , ); Отказ = Истина;
			КонецЕсли;	
				
		ИначеЕсли ТС.ТипПродажи = Перечисления.AzRyДоговорТипПродажи.Сервис Тогда	
			 
			Если Не ЗначениеЗаполнено(ТС.ОтветственныйЗаПроизводство) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поля таблицы документа [Тип продажи]["+ТС.НомерСтроки+"][Ответственный за производство] не заполнены.';ka='[გაყიდვის ტიპის]["+ТС.НомерСтроки+"][წარმოებაზე პას. პირი] დოკუმენტის ცხრილის ველები შეუვსებელია, გთხოვთ გადაამოწმეთ.'"), , ); Отказ = Истина;
			ИначеЕсли Не ЗначениеЗаполнено(ТС.ПериодичностьСписаниеЗапасов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поля таблицы документа [Тип продажи]["+ТС.НомерСтроки+"][Периодичность списание запасов] не заполнены.';ka='[გაყიდვის ტიპის]["+ТС.НомерСтроки+"][მარაგების ჩამოწერის პერიოდულობა] დოკუმენტის ცხრილის ველები შეუვსებელია, გთხოვთ გადაამოწმეთ.'"), , ); Отказ = Истина;
			КонецЕсли;
	
		КонецЕсли;
	КонецЦикла;	
	
	// 2) Проверка Поля Страницы ТипПродажи
	Если Объект.ГарантийныеУсловия Тогда
		Если Объект.ГарантийныеУсловияДатаОкончания = Дата(1,1,1) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""ГарантийныеУсловияДатаОкончания"" не заполнено';ka='ველი ""საგარანტიო პირობების საბოლოო თარიღი"" არ არის შევსებული'"), ,"ГарантийныеУсловияДатаОкончания");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.ПереходКПоддержке Тогда
		Если Объект.ПереходКПоддержкеДатаОкончания = Дата(1,1,1) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""ПереходКПоддержкеДатаОкончания"" не заполнено';ka='ველი ""გადადის მხარდაჭერაში საბოლოო თარიღი"" არ არის შევსებული'"), ,"ПереходКПоддержкеДатаОкончания");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.ПереходВУслуги Тогда
		Если Объект.ПереходВУслугиДатаОкончания = Дата(1,1,1) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""ПереходВУслугиДатаОкончания"" не заполнено';ka='ველი ""გადადის სერვისში საბოლოო თარიღი"" არ არის შევსებული'"), ,"ПереходВУслугиДатаОкончания");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.ПриобретениеИзСвоейКомпании Тогда
		Если Не ЗначениеЗаполнено(Объект.ПриобретениеИзСвоейКомпанииНаимОрг) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""НаименованиеОрганизаций"" не заполнено';ka='ველი ""კომპანიის დასახელება"" არ არის შევსებული'"), ,"ПриобретениеИзСвоейКомпании");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Отказ;

КонецФункции

&НаКлиенте
Процедура ТипПродажиПриИзменении(Элемент)
	ОбновитьОформлениеТЗ();
	Элементы.ТипПродажи.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТипПродажиПослеУдаления(Элемент)
	ОбновитьОформлениеТЗ();
	Элементы.ТипПродажи.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтактноеЛицоПриИзмененииНаСервере()
	
	Если СокрЛП(Объект.ТелефонОсновной) = "" Или СокрЛП(Объект.ТелефонМобильный) = "" Или СокрЛП(Объект.АдресЭлектроннойПочты) = "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактныеЛицаКонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
		|	КонтактныеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	КонтактныеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	КонтактныеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	КонтактныеЛицаКонтактнаяИнформация.Страна КАК Страна,
		|	КонтактныеЛицаКонтактнаяИнформация.Регион КАК Регион,
		|	КонтактныеЛицаКонтактнаяИнформация.Город КАК Город,
		|	КонтактныеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	КонтактныеЛицаКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
		|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов
		|ИЗ
		|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.КонтактноеЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Первый = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Первый Тогда
				ТелефонОсновной = ВыборкаДетальныеЗаписи.Представление;
				Первый = Ложь;
				Продолжить;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Не Первый Тогда
				ТелефонМобильный = ВыборкаДетальныеЗаписи.Представление;
				Продолжить;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				АдресЭлектроннойПочты = ВыборкаДетальныеЗаписи.Представление;
				Продолжить;
			КонецЕсли;						
		КонецЦикла;
		
		Если СокрЛП(Объект.ТелефонОсновной) = "" Тогда
			Объект.ТелефонОсновной = ТелефонОсновной;
		КонецЕсли;                                   
		Если СокрЛП(Объект.ТелефонМобильный) = "" Тогда
			Объект.ТелефонМобильный = ТелефонМобильный;
		КонецЕсли; 
		Если СокрЛП(Объект.АдресЭлектроннойПочты) = "" Тогда
			Объект.АдресЭлектроннойПочты = АдресЭлектроннойПочты;
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

//////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

//////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
